Revit 2026 API

# IFCTransaction Properties

---

The IFCTransaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace